In [1]:
import pandas as pd

In [3]:
d0 = pd.read_csv('https://stepik.org/media/attachments/course/4852/submissions_data_train.zip')
d0.head()

   step_id   timestamp submission_status  user_id
0    31971  1434349275           correct    15853
1    31972  1434348300           correct    15853
2    31972  1478852149             wrong    15853
3    31972  1478852164           correct    15853
4    31976  1434348123             wrong    15853

In [4]:
dc0 = d0.query('submission_status == "correct"')
dw0 = d0.query('submission_status == "wrong"')

In [22]:
dc1 = dc0.drop(columns=['timestamp','submission_status'])
dc1.shape

(222705, 2)

In [27]:
# dc1 - DataFrame, which contains pairs (step_id, user_id) for cases where user_id has at least one correct submission
# for step_id
dc1 = dc1.drop_duplicates()

In [25]:
# dw1 - DataFrame, which contains pairs (step_id, user_id) for cases where user_id has at least one wrong submission
# for step_id
dw1 = dw0.drop(columns=['timestamp','submission_status'])
dw1.shape

(286399, 2)

In [29]:
dw1 = dw1.drop_duplicates()
dw1.head()

    step_id  user_id
2     31972    15853
4     31976    15853
15    32031    15853
33    32795    15853
38    32812    15853

In [32]:
#dw2 - pairs (step_id, user_id) for cases where user_id has only wrong submissions for step_id
dw2 = dw1[(~dw1.isin(dc1))]
dw2.shape

(82976, 2)

In [33]:
dw2.head()

    step_id  user_id
2     31972    15853
4     31976    15853
15    32031    15853
33    32795    15853
38    32812    15853

In [42]:
#dw3 - DataFrame dw2 grouped by step_id, counting users, that tried but haven't solved given step_id
#sort dw3 by n_users we have at top step_id that have much users
dw3 = dw2.groupby('step_id')['user_id'].agg('count').to_frame().reset_index()
dw3 = dw3.rename(columns={'user_id':'n_users'})
dw3.head()

   step_id  n_users
0    31971     2517
1    31972     3064
2    31976     2034
3    31977     2332
4    31978     3423

In [43]:
dw3.sort_values('n_users', ascending = False).head()

    step_id  n_users
4     31978     3423
11    32031     3255
1     31972     3064
19    32202     2614
0     31971     2517